<?php
/*
 * @Author: your name
 * @Date: 2020-08-17 10:02:23
 * @LastEditTime: 2020-08-17 10:43:53
 * @LastEditors: Please set LastEditors
 * @Description: In User Settings Edit
 * @FilePath: \vue_cni\php\api\getnewsinfo.php
 */
header('Access-Control-Allow-Origin:*');
header('Content-Type:application/json;charset=utf-8');
$data = array(
    array('id' => 1, 'title' => '绿水青山，就是金山银山', 'add_time' => date("Y-m-d"), 'content' => '<p>　　“绿水青山就是金山银山”理念(以下简称“两山”理念)，是《习近平谈治国理政》第三卷有关生态文明建设和生态环境保护的核心内容，擘画了生态文明建设的宏伟蓝图。践行“两山”理念的关键是将自然生态财富转化为经济社会财富，打通“两山”的转化通道。青海省始终保持生态保护优先的发展定力，深刻把握“三个最大”省情定位，牢固树立和践行“两山”理念，深入实施“一优两高”，高位推动国家公园示范省建设，奋力走出了经济与环境协调发展、人与自然和谐共生的新模式。但在实践中也出现了多期叠加的过程性与阶段性问题和困难，亟需通过优化条件、培育市场、完善制度、提升认知等措施，深入推进“两山”实践、持续拓展转化路径，以提高转化质量和综合效益。</p><p>　　优化“绿水青山”的转化条件。创造良好的“绿水青山”转化环境是推动“两山”转化的基础。一要加大生态保护修复力度。以保障青藏高原生态安全和生态系统服务功能整体提升为目标，加快实施“五大生态板块”重大生态保护修复工程，开展国土综合整治修复、矿山环境恢复治理、生物多样性保护等工作，推动高寒生态系统得到整体保护和系统修复，提升“绿水青山”生产能力。二要确定青海“绿水青山”权益。加快开展自然资源资产统一确权登记，积累经验后，开展自然生态空间统一确权登记工作。创新自然资源全民所有权和集体所有权的实现形式，除重要生态功能区外，可推动所有权和使用权相分离，适度扩大使用权的出让、转让、出租、担保、入股等权能。三要开展全域“绿水青山”价值核算。“两山”转化产品价值评估是“两山”落地以及经营性和公益性资产平衡转换的过程，在目前已有评价成果的基础，采用标准统一的方法补充、细化和完善青海省生态资源、生态系统服务价值和生态产品价值核算工作。</p><p>　　加快培育建立生态产业市场。培育生态产业市场是实现“两山”转化的重要途径。一要丰富“两山”转化产品的种类和功能，实现“绿水青山”的多元化发展。确认和细化“绿水青山”在国土空间规划、国土空间用途管制和生态保护红线划定等方面设置指标的财产权属性，丰富生态产品种类和作用，推动多样化品质化品牌化生态产业发展。二要规范平等交易主体。“两山”交易主体多元化，各交易主体实际掌握的权能不一致，易造成其权益不匹配、不平等，因此规范平等各交易主体应是“绿水青山”价值实现的重要目标。三要限定生态产品市场交易的空间和规模。依据区域生态承载力、产业发展条件和市场需求潜力，尽可能实现与国土空间用途管制、区域经济发展水平和供需平衡规律接轨。四要搭建“两山”交易统一平台。建立统一的生态资源交易平台，按照统一交易规则，在公开市场上进行交易，并统一发布全国生态资源交易的政策法规和市场信息，强化生态资源市场交易动态监管。</p><p>　　完善“两山”转化的制度保障。建立系统化制度体系是促进“两山”转化的保障条件。一要建立健全地方性法律法规体系。对青海“两山”转化产品的内涵类型、价值核算机制、实现途径等内容进行规定。明确“两山”转化产品实现管理部门及其职责，制定“两山”转化产品实现的青海区域实施细则。结合实践需求，完善修改配套法律法规和相关政策，如地方性生态补偿条例等。二要建立“两山”转化市场保障机制。包括、生态资源有偿使用机制、生态资源价格形成机制、生态产品认证机制、生态产品价值核算机制、生态补偿机制、生态市场交易机制等。三要健全生态产品保护绩效评价考核和责任追究制度。在领导干部环境考核和自然资源资产离任审计中，严格执行并完善《青海省生态文明建设促进条列》《青海省党政领导干部生态环境损害责任追究实施细则》《青海省领导干部自然资源资产离任审计工作指导意见》等，强调“绿水青山”保护，强化管理者对生态产品保护的过程介入。</p><p>　　全面提升“两山”转化的认知水平。转变思想、发挥主观能动性是打通“两山”转化通道的智力支撑。一要加强全社会“两山”理论价值宣传教育。在“两山”转化过程中，全社会应充分认识到生态资源所蕴含的经济价值，真正认识到青海加快推进“两山”转化的重要性和迫切性。全体社会成员应自觉履行生态保护义务，主动参与“两山”转化。二要开展“两山”转化示范基地建设。严格评选具有代表性和典型性的“两山”示范基地，通过机制研究和实践探索，归纳总结做法经验，形成可复制可推广的模式，发挥辐射带动作用。三要巩固领导干部“两山”认知水平和强化政治责任。坚决贯彻习近平生态文明思想，坚决担当生态环境保护政治责任，把为民办事、为民造福作为最重要政绩的信念和定力。杜绝一切以牺牲环境为代价的开发利用，自觉当好生态文明建设的引领者和推动者。</p><p>　　(作者系青海省委党校副教授)</p>', 'click' => 1,
    ),
    array('id' => 2, 'title' => '绿水青山，就是金山银山', 'add_time' => date("Y-m-d"), 'content' => '对于人类来说，绿水青山，就是金山银山', 'click' => 2,
    ),
    array('id' => 3, 'title' => '绿水青山，就是金山银山', 'add_time' => date("Y-m-d"), 'content' => '对于人类来说，绿水青山，就是金山银山', 'click' => 0,
    ),
    array('id' => 4, 'title' => '绿水青山，就是金山银山', 'add_time' => date("Y-m-d"), 'content' => '对于人类来说，绿水青山，就是金山银山', 'click' => 1,
    ),
    array('id' => 5, 'title' => '绿水青山，就是金山银山', 'add_time' => date("Y-m-d"), 'content' => '对于人类来说，绿水青山，就是金山银山', 'click' => 1,
    ),
    array('id' => 6, 'title' => '绿水青山，就是金山银山', 'add_time' => date("Y-m-d"), 'content' => '对于人类来说，绿水青山，就是金山银山', 'click' => 1,
    ),
    array('id' => 7, 'title' => '绿水青山，就是金山银山', 'add_time' => date("Y-m-d"), 'content' => '对于人类来说，绿水青山，就是金山银山', 'click' => 1,
    ),
    array('id' => 8, 'title' => '绿水青山，就是金山银山', 'add_time' => date("Y-m-d"), 'content' => '对于人类来说，绿水青山，就是金山银山', 'click' => 1,
    ),
    array('id' => 9, 'title' => '绿水青山，就是金山银山', 'add_time' => date("Y-m-d"), 'content' => '对于人类来说，绿水青山，就是金山银山', 'click' => 1,
    ),
);
// $_SERVER包含了诸多头信息、路径、以及脚本位置等等信息的数组，这个数组中的项目有web服务器创建
if ($_SERVER['REQUEST_METHOD'] == 'GET' ? true : false) {
    if ($_GET['id']) {
        foreach ($data as $item) {
            if ($item['id'] != $_GET['id']) {
                continue;
            }
            $item = array('status' => 0, 'message' => $item);
            $json = json_encode($item);
            echo $json;
        }
    } else {
        echo '该访问方式不能获取数据';
    }
} else {
    echo '该访问方式不能获取数据';
}
